'''
Количество различных символов
На вход программе подается строка текста. 
Напишите программу, которая определяет количество различных символов в строке.

На вход программе подается строка текста.

Программа должна вывести количество различных символов в строке.

Примечание. 
Задачу можно решить в одну строчку кода.
'''

print(len(set(input())))