'''
Дополните приведенный код, 
чтобы он вывел сумму квадратов элементов множества numbers.
'''

# example
numbers = {9089, -67, -32, 1, 78, 23, -65, 99, 9089, 34, -32, 0, -67, 1, 11, 111, 111, 1, 23}

# review 1
numbers = {9089, -67, -32, 1, 78, 23, -65, 99, 9089, 34, -32, 0, -67, 1, 11, 111, 111, 1, 23}
sum_sq_el = sum([i ** 2 for i in numbers])
print(sum_sq_el)

# review 2
numbers = {9089, -67, -32, 1, 78, 23, -65, 99, 9089, 34, -32, 0, -67, 1, 11, 111, 111, 1, 23}
print(sum(i*i for i in numbers))