'''Максимальный в области 2
Напишите программу, 
которая выводит максимальный элемент 
в заштрихованной области квадратной матрицы.

    ------------------------------------------------.
    =                                            .:=.
    =                                          .::.=.
    =                                        .::.::=.
    =                                      .::..:..=.
    =                                    .::..:..::=.
    =                                   ::..:..::.:=.
    =                                ..:..:..::.::.=.
    =                              ..:..-..::..:..:=.
    =                            ..:..::.::..:..::.=.
    =                          ..:..::..-..-..::.::=.
    =                        ..::.::..:..-..::.::..=.
    =                        ::.::..:..-..::..:..:.=.
    =                      ::..-..:..-...-..-..::.:+.
    =                   .::..=..::.::..-..-..::.::.=.
    =                ..::..-..::.::..:..-..::.::..-=.
    =              ..::..-..::.::..:..-..::..:..:..=.
    =            ...:..:..::..-..:..::..-..-..::.::=.
    =           ..:..::.::..-..::.::..:..-..::.::..=.
    =         ..:..::.::..-..::.::..:..:..::.::..:.=.
    =       ..:..::.::..:..::.::..:..::.::..:..:..:=.
    =     ..:..::..:..:..::..-..:..::.::..:..::.::.=.
    =   ..::.::..:..::.::..-..::.::..:..:..::.::..:=.
    = ..::.::..:..::.::..:..::.::..:..:..::.::..:..=.
    =.::..:..:..::.::..:..::.::..:..:..::..:..:..::=.
    =----------=------------=---------=------------=.

    
На вход программе подаётся натуральное число n — 
количество строк и столбцов в матрице, затем элементы матрицы.

Программа должна вывести одно число — 
максимальный элемент в заштрихованной области квадратной матрицы.

Примечание. 
Элементы побочной диагонали также учитываются.
'''

n = int(input())
matrix = [[int(i) for i in input().split()] for _ in range(n)]
mx = matrix[0][n - 1]

for row in range(n):
    for col in range(n):
        if row >= n - 1 - col:
            if matrix[row][col] > mx:
                mx = matrix[row][col]

print(mx)