'''
Дополните приведенный ниже код так, 
чтобы он вывел список, 
содержащий средние арифметические значения чисел 
каждого вложенного кортежа в заданном кортеже кортежей numbers.
'''

# example
numbers = ((10, 10, 10, 12), (30, 45, 56, 45), (81, 80, 39, 32), (1, 2, 3, 4), (90, 10))

# review 1
numbers = ((10, 10, 10, 12), (30, 45, 56, 45), (81, 80, 39, 32), (1, 2, 3, 4), (90, 10))
av = []
for el in numbers:
    sm = sum(el)
    ln = len(el)
    el_av = sm / ln
    av.append(el_av)
print(av)

# review 2
numbers = ((10, 10, 10, 12), (30, 45, 56, 45), (81, 80, 39, 32), (1, 2, 3, 4), (90, 10))
av_nums = [sum(tup) / len(tup) for tup in numbers]
print(av_nums)