'''
В таблице приведены запросы и количество страниц, 
которые нашел поисковый сервер Google 
по этим запросам в сегменте Интернета:

| Запрос                       | Количество страниц (тыс.) |
| ---------------------------- | ------------------------- |
| математика & ЕГЭ             | 315                       |
| математика & параметры       | 225                       |
| математика & параметры & ЕГЭ | 110                       |

Какое количество страниц (в тысячах) 
будет найдено по запросу (параметры | ЕГЭ) & математика?

Примечание. 
В языке запросов поискового сервера 
для обозначения логической операции «ИЛИ» (объединение) 
используется символ «|», 
а для обозначения логической операции «И» (пересечение) — 
символ «&».
'''

# Ответ: 315 + 225 - 110 = 430