'''
Ходы коня 🐎

На шахматной доске 8×8 стоит конь. 
Напишите программу, которая отмечает положение коня на доске 
и все клетки, которые бьет конь. 
Клетку, где стоит конь, отметьте английской буквой N, 
а клетки, которые бьет конь, отметьте символами *, 
остальные клетки заполните точками.

На вход программе подаются координаты коня на шахматной доске 
в шахматной нотации 
(то есть в виде e4, где сначала записывается номер столбца 
(буква от a до h, слева направо), 
затем номеру строки (цифра от 1 до 8, снизу вверх)).

Программа должна вывести на экран изображение доски, 
разделяя элементы пробелами.

:...:-....::....-....:-....-:....:....:-:...:-...:
:.......*####*.....+####*:....-#####:....-#####=.:
:-.     %@@@@#    .#@@@@#:   .-@@@@@:    -@@@@@+-:
:..     %@@@@#    .#@@@@#:   .-@@@@@:    -@@@@@+.:
:.+@@@@@:....-@@@@@-....-%@@@@#.....%@@@@#.......:
:-+@@@@@:    -@@@@@-    -%@@@@#.   .%@@@@#.    .::
:.+@@@@@:    -@@@@@-    -%@@@@#.   .%@@@@#.    ..:
:.-++++++****+++++++****+++++++*****+++++++****-.:
:-.     %@@@@#    .#@@@@#:   .-@@@@@:    -@@@@@+::
:..     %@@@@#    .#@@@@#:   .-@@@@@:    -@@@@@+.:
:.=*****======*****+=====******=====******=====:.:
:-+@@@@@:    -@@@@@-    -%@@@@#.   .%@@@@#.    :-:
:.+@@@@@:    -@@@@@-    -%@@@@#.   .%@@@@#.    ..:
:..     %@@@@#    .#@@@@#:   .-@@@@@:    -@@@@@+.:
:..     %@@@@#    .#@@@@#:   .-@@@@@:    -@@@@@+.:
:..     %@@@@#    .#@@@@#:   .-@@@@@:    -@@@@@+.:
:.:-----*####*-----*####*=----=#####=----=#####=.:
::+@@@@@:    -@@@@@-    -%@@@@#.   .%@@@@#.    ..:
::+@@@@@:    -@@@@@-    -%@@@@#.   .%@@@@#.    .::
:.-++++++++++++++++++++++++++++++++++++++++++++-.:
:-.     %@@@@#    .#@@@@#:   .-@@@@@:    -@@@@@+::
:..     %@@@@#    .#@@@@#:   .-@@@@@:    -@@@@@+.:
:.-++++++++++++++++++++++++++++++++++++++++++++-.:
:.+@@@@@:    -@@@@@-    -%@@@@#.   .%@@@@#.    ..:
:.+@@@@@:    -@@@@@-    -%@@@@#.   .%@@@@#.    ..:
:.=#####:....-#####-....-*####+.....*####+.......:
:...-:...:-:...::....-:....-....-:....:-....::...:

'''

n = input()
x = ord(n[0]) - 96
y = int(n[1])
matrix = [['.'] * 8 for _ in range(8)]
matrix[8 - y][x - 1] = 'N'
for i in range(8):
    for j in range(8):
        if (abs(x - (j + 1)) == 2 and abs(y - (8 - i)) == 1) or (abs(x - (j + 1)) == 1 and abs(y - (8 - i)) == 2):
            matrix[i][j] = '*'
print(*[' '.join(matrix[i]) for i in range(8)], sep='\n')